<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"5bc46445cd16a456b6fb99eda40e88a46a81079811beccc150a41d94b852c930","plan_job_ref":"Job Run Terraform plan in staging #166 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/12817947990","plan_out_hash":"7113d2c2dfc069385a147c4d96cbd3fc84a0b11a5e39ec0fdca373fa74afee8b","plan_hash":"b929bafba83e744e332ac8162bdc93f38bb8b405fb2054eba2d8cbe19b869bf0","plan_text_format":"diff","version":"1.46.0"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudfoundry_network_policy.egress_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "egress_routing" {
        id = "05a74ebf-eccc-3593-abce-90c94c007b39"

-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "8080" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51"
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "8080"
+           protocol        = "tcp"
+           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51"
        }
    }

  # module.egress_proxy.cloudfoundry_app.egress_app will be updated in-place
!~  resource "cloudfoundry_app" "egress_app" {
!~      created_at                  = "2024-12-26T21:32:43Z" -> (known after apply)
!~      disk_quota                  = "2048M" -> (known after apply)
!~      health_check_type           = "port" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "egress-proxy-staging"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      source_code_hash            = "59e07347902f0f8808366b9a0f3fc17eeec3889f26ee71a08eecc006e669bd51" -> "af00d9f0ed4f5adb1116397a9f6dcc7dd456903620ea757caf405265c9ab1746"
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-01-16T19:04:40Z" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #166](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/12817947990)